read_verilog capa_transaccion.v

hierarchy -check -top capa_transaccion

proc; opt; fsm; opt; memory; opt

techmap; opt

clean

write_verilog capa_transaccion_synth.v
show capa_transaccion